ninharp/esp32-laser-parcour/laser_unit/sdkconfig.defaults
# ESP32-C3 Configuration
CONFIG_IDF_TARGET="esp32c3"

# Serial flasher config
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# Partition Table
CONFIG_PARTITION_TABLE_SINGLE_APP=y

# Compiler options
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# Component config
CONFIG_FREERTOS_HZ=1000

# ESP32C3-Specific
CONFIG_ESP32C3_DEFAULT_CPU_FREQ_160=y

# Bootloader config
CONFIG_BOOTLOADER_LOG_LEVEL_INFO=y

# Log output
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
